
for i in 83 99 104 111 111 108 45 50 49; do 
    printf "\\$(printf '%03o' $i)"; # внутренним prinf переводим в восьмеричную систему - "о"
    # а внешним в ascii 
done;
echo "" # переводим на новую строчку


echo "83 99 104 111 111 108 45 50 49" | awk '{for(i=1;i<=NF;i++) printf "%c", $i; print ""}'
# отправляем символы прямиком в awk от 1 до NF (количество переданных символов),
# которое awk сам посчитал и приводим данные к типу ASCII - %c

echo "d1/81/d1/8a/d0/b5/d1/88/d1/8c/20/d0/b5/d1/89/d1/91/20
/d1/8d/d1/82/d0/b8/d1/85/20/d0/bc/d1/8f/d0/b3/d0/ba/d0/b8/d1
/85/20/d1/84/d1/80/d0/b0/d0/bd/d1/86/d1/83/d0/b7/d1/81/d0/ba
/d0/b8/d1/85/20/d0/b1/d1/83/d0/bb/d0/be/d0/ba/2c/20/d0/b4/d0
/b0/20/d0/b2/d1/8b/d0/bf/d0/b5/d0/b9/20/d1/87/d0/b0/d1
/8e" | tr -d '/' | xxd -r -p;  # xxd -r декодирование -p чистого hex
 # tr - потоковая обработка тексат. в данном случае вырезаем слэш //
echo ""
echo "d181" | xxd -r -p;
echo ""

echo -n "Ехал Грека через реку" | base64
# -n - не добавлять в конце знак переноса